[
  {
    "id": "exp-1",
    "role": "Full Stack Developer (Freelance)",
    "company": "Playlit",
    "companyUrl": "https://playlit.com",
    "location": "Remote",
    "startDate": "2025-01",
    "endDate": "Present",
    "current": true,
    "description": [
      "Designed a data-centric music platform with authentication, artist analytics, and structured content uploads.",
      "Developed role-based dashboards to support internal performance monitoring and management.",
      "Designed and managed a waitlist system that captures user interaction metrics from more than 400+ users.",
      "Architected scalable back-end infrastructure for reliable data handling and user behavior tracking."
    ],
    "technologies": ["Next.js", "Neon DB", "Clerk Auth", "Cloudinary"]
  },
  {
    "id": "exp-2",
    "role": "SDE Intern",
    "company": "Titan Company Ltd",
    "companyUrl": "https://www.titan.co.in",
    "location": "Bengaluru",
    "startDate": "2024-06",
    "endDate": "2024-07",
    "current": false,
    "description": [
      "Improved SQL query performance and reporting precision for Tanishq Jewelry's data systems by identifying and resolving bottlenecks.",
      "Built a Python-based store locator data pipeline, replacing time-consuming manual lookup with automated data extraction.",
      "Authored Business Requirements and Technical Specification Documents for a limit automation initiative, aligning output with analyst expectations.",
      "Collaborated with business analysts to document workflows, schema mappings, and process automations for technical reporting.",
      "Contributed to internal ML research on Vision Transformers and CNNs, focusing on scalable inference strategies for analytics solutions."
    ],
    "technologies": ["Python", "SQL", "Vision Transformers", "CNN", "Data Pipeline", "ML Research"]
  },
  {
    "id": "exp-3",
    "role": "Technical Team Lead",
    "company": "NULL Chapter Vijayawada",
    "companyUrl": "",
    "location": "Vijayawada",
    "startDate": "2023-01",
    "endDate": "Present",
    "current": true,
    "description": [
      "Designed Capture the Flag (CTF) problems focused on reverse engineering and data handling for technical competitions.",
      "Facilitated workshops on data security, analytics, and vulnerability assessment.",
      "Mentored members in structured problem-solving and investigative analysis techniques."
    ],
    "technologies": ["Cybersecurity", "CTF", "Reverse Engineering", "Data Security"]
  },
  {
    "id": "exp-4",
    "role": "Tech Python Co-Lead",
    "company": "NextGen Cloud",
    "companyUrl": "",
    "location": "",
    "startDate": "2023-01",
    "endDate": "2024-12",
    "current": false,
    "description": [
      "Built an e-commerce system emphasizing transactional data flow and user data management.",
      "Provided hands-on sessions on back-end analytics, performance debugging, and query optimization."
    ],
    "technologies": ["Python", "E-commerce", "Backend", "Data Management", "Analytics"]
  },
  {
    "id": "exp-5",
    "role": "Content Team Member",
    "company": "Machine Learning Club",
    "companyUrl": "",
    "location": "",
    "startDate": "2022-01",
    "endDate": "2023-12",
    "current": false,
    "description": [
      "Participated in data preprocessing, model evaluation, and reporting accuracy for ML-based student projects.",
      "Organized peer review sessions to improve analytical approaches and data storytelling."
    ],
    "technologies": ["Machine Learning", "Data Preprocessing", "Model Evaluation", "Python"]
  }
]
