[
  {
    "id": "vitap-marketplace",
    "title": "VIT-AP Student Marketplace Platform",
    "description": "Full-stack marketplace web application enabling VIT-AP students to buy, sell, and trade items within the campus community with real-time messaging capabilities",
    "longDescription": "Developed a full-stack marketplace web application enabling VIT-AP students to buy, sell, and trade items within the campus community with real-time messaging capabilities. Implemented secure authentication and authorization using Clerk with role-based access control for students and administrators, including email domain validation for campus-exclusive access. Designed and built RESTful APIs for post management, conversation handling, and user profiles with PostgreSQL database integration using Neon serverless architecture. Created responsive UI components with real-time message notifications, image upload functionality via Cloudinary, and dynamic filtering by categories and hostels. Integrated middleware for protected routes, onboarding workflows, and implemented error boundaries for robust error handling and improved user experience.",
    "thumbnail": "/images/projects/vitap-marketplace.jpg",
    "tech": ["Next.js 14", "TypeScript", "React", "PostgreSQL", "Clerk Auth", "Tailwind CSS", "Cloudinary", "shadcn/ui", "Neon"],
    "link": "https://vitap-marketplace.vercel.app/",
    "github": "",
    "category": "Full Stack",
    "featured": true
  },
  {
    "id": "hybrid-cnn-transformer",
    "title": "Hybrid CNN-Transformer for Skin Texture Analysis",
    "description": "Hybrid CNN-Transformer architecture to analyze and classify skin textures with 82% test accuracy",
    "longDescription": "Implemented a Hybrid CNN-Transformer architecture combining convolutional layers for local features and transformer blocks for global context. Applied data preprocessing techniques including normalization and augmentation to improve generalization. Evaluated performance using accuracy and loss metrics; achieved 82% test accuracy.",
    "thumbnail": "/images/projects/skin-texture.jpg",
    "tech": ["Python", "TensorFlow", "Keras", "NumPy", "Matplotlib"],
    "github": "",
    "category": "Machine Learning",
    "featured": true
  },
  {
    "id": "career-guidance-chatbot",
    "title": "Career Guidance Chatbot",
    "description": "AI-powered recommendation system for career suggestions using structured user profiling and LLM-based intent understanding",
    "longDescription": "Built a recommendation system for career suggestions using structured user profiling and data persistence mechanisms. Developed back-end using Flask and SQLAlchemy; managed analytics using AWS Lambda for performance reporting. Integrated Gemini API to enhance LLM-based intent understanding and improve recommendation accuracy.",
    "thumbnail": "/images/projects/career-chatbot.jpg",
    "tech": ["Python", "Flask", "SQLAlchemy", "Gemini API", "AWS Lambda", "AWS EC2"],
    "github": "",
    "category": "Natural Language Processing",
    "featured": true
  },
  {
    "id": "sentiment-analysis-platform",
    "title": "AI-Powered Sentiment Analysis Platform",
    "description": "Deployed sentiment models combining lexicon and transformer-based methods for scalable, real-time insights from web reviews",
    "longDescription": "Deployed sentiment models combining lexicon and transformer-based methods for scalable, real-time insights from web reviews. Automated real-time web scraping to collect datasets and support competitor analysis. Created interactive dashboards with trend visualizations for decision-making.",
    "thumbnail": "/images/projects/sentiment-platform.jpg",
    "tech": ["Hugging Face Transformers", "VADER", "Beautiful Soup", "Scrapy", "RapidAPI", "Chart.js"],
    "github": "",
    "category": "Natural Language Processing",
    "featured": true
  },
  {
    "id": "trip-planner-blog",
    "title": "Trip Planner & Blog Creator",
    "description": "LLM-powered itinerary generator with mapping and storytelling modules, integrating multi-source data for user personalization",
    "longDescription": "Developed an LLM-powered itinerary generator with mapping and storytelling modules, integrating multi-source data for user personalization. Enabled structured export of itineraries as PDFs for enhanced user experience and offline access.",
    "thumbnail": "/images/projects/trip-planner.jpg",
    "tech": ["Gemini API", "Python", "Flask", "Google Maps API", "FPDF", "OpenAI API"],
    "github": "",
    "category": "Machine Learning",
    "featured": true
  }
]
